Tekla.Structures.Analysis.AnalysisModelDesignProperties
The AnalysisModelDesignProperties class contains information related to analysis model design properties.

Tekla.Structures.Analysis.AnalysisModelDesignProperties._AnalysisModelName
The name of the analysis model.

Tekla.Structures.Analysis.AnalysisModelDesignProperties._SteelDesign
The steel code used.

Tekla.Structures.Analysis.AnalysisModelDesignProperties._ConcreteDesign
The concrete code used.

Tekla.Structures.Analysis.AnalysisModelDesignProperties._TimberDesign
The timber code used.

Tekla.Structures.Analysis.AnalysisModelDesignProperties._SteelDesignMethod
The steel design method.

Tekla.Structures.Analysis.AnalysisModelDesignProperties._ConcreteDesignMethod
The concrete design method.

Tekla.Structures.Analysis.AnalysisModelDesignProperties._TimberDesignMethod
The timber design method.

Tekla.Structures.Analysis.AnalysisModelDesignProperties.SteelDesign
The steel code used.

Tekla.Structures.Analysis.AnalysisModelDesignProperties.ConcreteDesign
The concrete code used.

Tekla.Structures.Analysis.AnalysisModelDesignProperties.TimberDesign
The timber code used.

Tekla.Structures.Analysis.AnalysisModelDesignProperties.SteelDesignMethod
The steel design method.

Tekla.Structures.Analysis.AnalysisModelDesignProperties.ConcreteDesignMethod
The concrete design method.

Tekla.Structures.Analysis.AnalysisModelDesignProperties.TimberDesignMethod
The timber design method.

Tekla.Structures.Analysis.AnalysisModelDesignProperties.Select(System.String)
Selects the analysis model design properties.
The _AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisModelDesignProperties.Modify(System.String)
Modifies the analysis model design properties.
The AnalysisModelName has to be set.
AnalysisModelName: The name of the analysis model.

Tekla.Structures.Analysis.AnalysisModelDesignProperties.SelectInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisModelDesignProperties.ModifyInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisModelDesignProperties.CollectData
Collects additional data.